


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.АктивныеПосещения.Записывать = Истина;

	Для Каждого ТекСтрокаАттракционы из Аттракционы Цикл
		Движение = Движения.АктивныеПосещения.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Основание = Ссылка;
		Движение.Аттракцион = ТекСтрокаАттракционы.Аттракцион;
		Движение.КоличествоПосещений = ТекСтрокаАттракционы.Кличество;
	КонецЦикла;

	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСстрокаАттракционы из Аттракционы Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Аттрацион = ТекСстрокаАттракционы.Аттракцион;
		Движение.Сумма=ТекСстрокаАттракционы.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
