// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидНомеклатуры <> Перечисления.ВидНоменклатуры.ПосещениеАттракциона Тогда 
		НомерУдаляемогоРеквезита = ПроверяемыеРеквизиты.Найти("КоличествоПосещений");
		Если НомерУдаляемогоРеквезита <> Неопределено Тогда 
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемогоРеквезита);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
